//   - Создать программу, в которой две переменные - курс рубля к доллару
//  и количество доступных рублей. Вывести в консоль сколько долларов 
// можно купить на доступные рубли.
// let dollar = 0
// let rub = 839343
// let c = rub / 84
// console.log(`За ${rub}  вы можете купить ${c}`)




// - Создать переменные name, address, phone в которых с помощью prompt() 
// будет храниться значения имени, адреса и номер телефона. Вывести в 
// консоль текст “Студент . Адрес: , Номер телефона: ___” где вместо 
// пропусков будут соответствующие переменные. 

// let name =  'maga' 
// let addres = 'Grozny'
// let phone = 89783457665

// console.log(`Студент ${name} проживает по адресу ${addres}, номер для связи ${phone}`)



// - Какой тип данных нужно использовать, чтобы задать дату 
// формата 28.02.1999?

// let day = 28.
// let m = '.02.'
// let g = 1999
// console.log(day+m+g)

// Какой тип данных нужен для сохранения числа ПИ 3.14?

// let pi = '3.14'



// - Создать константу с любым значением и попытаться изменить это 
// значение. Выяснить что в итоге получится.

const y = 35;
y = 374;
y++
console.log(y)